// Задача 23 Напишите программу, которая принимает на вход число (N) и выдаёт таблицу кубов чисел от 1 до N.

Console.Write("Введите число N:");
void numbercuиed (int number) {
for (int i = 1, i<number, i++)
    int cube 
}
Console.WriteLine();
